/***************(C)COPYRIGHT 2017 Vrunbst工作室_WXD***************
*文件名         :ESP8266_AT_CMD.c
*描述           :ESP8266模块AT指令合集
*实验平台       :ESP8266模块
*库版本         : V1.0
*嵌入式系统     : 无
*作者           : 武旭东
*修改历史       : 2017.11.17
*备注           :
**************************************************************************/
/*数据拆分宏定义，可将32位、16位数字拆分为单字节*/
#define BYTE0(dwTemp)       ( *( (unsigned char *)(&dwTemp)		) )
#define BYTE1(dwTemp)       ( *( (unsigned char *)(&dwTemp) + 1) )
#define BYTE2(dwTemp)       ( *( (unsigned char *)(&dwTemp) + 2) )
#define BYTE3(dwTemp)       ( *( (unsigned char *)(&dwTemp) + 3) )
/********************************************************************
*说明: 测试AT启动
*参数:无
*返回:ESP8266返回OK
*备注:
*作者:武旭东
*********************************************************************/
unsigned char AT[]="AT\r\n";
/********************************************************************
*说明:重启模块
*参数:无
*返回:ESP8266返回OK
*备注:
*作者:武旭东
*********************************************************************/
unsigned char AT_RST[]="AT+RST\r\n";
/********************************************************************
*说明:查询版本信息
*参数:无
*返回:
        <AT version info> AT版本信息
        <SDK version info>基于SDK版本信息
        <compile time> 编译生成时间
*备注:
*作者:武旭东
*********************************************************************/
unsigned char AT_GMR[]="AT+GMR\r\n";
/********************************************************************
*说明:进入deep-sleep模式
*参数:<time>设置ESP8266睡眠时长，单位：毫秒，在休眠设定时长后自动唤醒
*返回:
        <time>
*备注:deep-sleep 功能需硬件支持
*作者:武旭东
*********************************************************************/
unsigned char AT_GO_DEEP_SLEEP(unsigned int ms,unsigned char *send)
{
	unsigned char i;
	unsigned char sendH[]="AT+GSLP";
	unsigned char *sendL;
	sendL[i++]=BYTE3(ms);
	sendL[i++]=BYTE2(ms);
	sendL[i++]=BYTE1(ms);
	sendL[i++]=BYTE0(ms);
	send=strcat(sendH,sendL);	
}
/********************************************************************
*说明:开关回显功能
*参数:无
*返回:无
*备注:
*作者:武旭东
*********************************************************************/
unsigned char ATE[]="ATE0\r\n";
/********************************************************************
*说明:恢复出厂设置
*参数:无
*返回:无
*备注:
*作者:武旭东
*********************************************************************/
unsigned char AT_RESTORE[]="AT+RESTORE\r\n";
/********************************************************************
*说明:恢复出厂设置
*参数:无
*返回:无
*备注:
*作者:武旭东
*********************************************************************/
unsigned char AT_RESTORE[]="AT+RESTORE\r\n";

